Repository: docmcfly/cyMailToNews
Catalog: Resources/Private/Language/*.locallang_task_mail2news.xlf
Languages: de

# task.mail2news.title
source: Mail to news creator
de: News aus E-Mail Erzeuger

# task.mail2news.description
source: Creates news from mails
de: Erzeugt News aus E-Mails

# task.mail2news.property.newsStoragePageId
source: News storoage page id
de: News-Speicher-Seiten-Id

# task.mail2news.property.draftMode
source: Create news as draft (disabled)
de: Erzeugen der News als Vorlage (deaktiviert)

# task.mail2news.property.titleTemplate
source: News title template
de: News-Überschrift

# task.mail2news.property.filterRules
source: Filter rules
de: Filterregeln

# task.mail2news.property.categoryRules
source: Category rules
de: Kategorie-Regeln

# task.mail2news.property.imapAccount
source: IMAP server account name
de: IMAP-Server-Account

# task.mail2news.property.importAttachmnents
source: Import the attachments as news media?
de: Mail-Anhänge als News-Medien importieren?

# task.mail2news.property.fileStorage
source: File storage to use (if value is empty or 0 then the task uses the default file storage)
de: Zu verwendener Dateispeicher (wenn leer oder 0 eingeben wurde, wird der Standard-Dateispeicher verwendet)

# task.mail2news.property.attachmentFolder
source: Storage folder for the imported attachments
de: Speicher-Ordner der importierten Anhänge

# task.mail2news.property.defaultMedia
source: Default media (This media is added to all new news but the mail has none attachment or the attachment import is disabled)
de: Standard-Medium (Diese Medium wird an alle neuen News hinzugefügt, wenn der Anhang-Import ist abgeschaltet ist oder die Mail keine Anhänge enthält)

# task.mail2news.property.allowedAttachmentTypes
source: Allowed file type for the attachment import
de: Erlaubte Datei-Typen für den Anhang-Import

# task.mail2news.property.error.invalid.newsStoragePageId
source: Invalid news storoage page id.
de: Ungültige News-Speicher-Seiten-Id.

# task.mail2news.property.error.required.newsStoragePageId
source: News storoage page id is required.
de: Der News-Speicher-Seiten-Id ist verpflichtend.

# task.mail2news.property.error.required.newsDummyText
source: News dummy text is required.
de: Der News-Dummy-Text ist verpflichtend.

# task.mail2news.property.error.required.categoryRules
source: The category rules are required.
de: Die Kategorie-Regeln ist verpflichtend.

# task.mail2news.property.error.jsonInvalid.categoryRules
source: The category rules have not an valid json format.
de: Die Kategorie-Regeln haben kein gültiges JSON-Format.

# task.mail2news.property.error.categoryUidNotFound.categoryRules
source: A category with the UID % not found.
de: Keine Kategorie mit der UID %s nicht gefunden.

# task.mail2news.property.error.wrongRuleDeclaration.categoryRules
source: The declaration of the category rules is incorrect. Format: [ 'subject|content' => 'regular expression' ]
de: Die Deklaration der Kategorie-Regeln ist falsch. Format: [ 'subject|content' => 'regulärer Ausdruck' ]

# task.mail2news.property.error.invalidRule.categoryRules
source: The rules (regular expression) %s are invalid.
de: Die Regel (Regulärer Ausdruck) %s ist ungültig.

# task.mail2news.property.error.jsonInvalid.filterRules
source: The filter rules have not an valid json format.
de: Die Filter-Regeln haben kein gültiges JSON-Format.

# task.mail2news.property.error.invalidRule.filterRules
source: The rules (regular expression) %s are invalid.
de: Die Regel (Regulärer Ausdruck) %s ist ungültig.

# task.mail2news.property.error.folderNotExists.attachmentFolder
source: The folder "%s" does not exists.
de: Der Datei-Ordner "%s" existiert nicht.

# task.mail2news.property.error.required.imapServer
source: The imap server name is required.
de: Der Imap-Servername ist verpflichtend.

# task.mail2news.property.error.required.imapPort
source: The imap port is required.
de: Der Imap-Serverport ist verpflichtend.

# task.mail2news.property.error.required.imapName
source: The imap server account name is required.
de: Der Imap-Account ist verpflichtend.

# task.mail2news.property.error.required.imapPassword
source: The imap password is required.
de: Das Imap-Serverpasswort ist verpflichtend.
